index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="bt-br" xml:lang="bt-br">
<head>
<title>Common Lisp Brasil</title>
<!-- 2018-02-12 Mon 09:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Manoel Vilela, Lucas Vieira" />
<link rel="stylesheet" type="text/css" href="/org-theme/dist/long/bundle.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Common Lisp Brasil</h1>
<div class="abstract">
<p>
Olá! Seja-bem vindo ao grupo de estudos
e projetos do Common Lisp Brasil!
</p>

<p>
Grupo oficial do Telegram: <a href="https://telegram.me/commonlispbr">Common Lisp Brasil</a>
</p>

<p>
Grupo não-oficial de Lisp Brasileiro IRC freenode: <a href="http://webchat.freenode.net/">#lisp-br</a>
</p>

<p>
Os dados a seguir podem estar incompletos ou conter erros. Proceda com
cuidado e, se você tiver uma sugestão ou reclamação, <a href="https://github.com/commonlispbr/commonlispbr.github.io">abra uma issue no
repositório desta página</a>.
</p>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Conceitos e Fundamentos</a>
<ul>
<li><a href="#sec-1-1">1.1. O que é Lisp?</a></li>
<li><a href="#sec-1-2">1.2. O que é Common Lisp?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Links de Aprendizado sobre Common Lisp</a>
<ul>
<li><a href="#sec-2-1">2.1. Apresentação</a></li>
<li><a href="#sec-2-2">2.2. Documentação e tutoriais</a></li>
<li><a href="#sec-2-3">2.3. Livros</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tooling</a>
<ul>
<li><a href="#sec-3-1">3.1. Emacs</a></li>
<li><a href="#sec-3-2">3.2. Portacle</a></li>
<li><a href="#sec-3-3">3.3. SLIME</a></li>
<li><a href="#sec-3-4">3.4. Compiladores</a></li>
<li><a href="#sec-3-5">3.5. Quicklisp</a></li>
<li><a href="#sec-3-6">3.6. Roswell</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Projetos</a></li>
<li><a href="#sec-5">5. Apêndice: Referências amplas</a></li>
</ul>
</div>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Conceitos e Fundamentos</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> O que é Lisp?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Dialetos Lisp <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>  têm uma sintaxe singular simplificada para denotar, listas e
símbolos, que podem ou não estarem associados a valores e/ou
procedimentos. Na linguagens da família Lisp, há a peculiaridade de
existir uma linha muito tênue de separação entre dados e procedimentos
no código-fonte. Na realidade, é possível produzir código a partir de
dados e vice-versa! Uma das características fortes da linguagem é o
uso da <a href="https://pt.wikipedia.org/wiki/Nota%25C3%25A7%25C3%25A3o_polonesa">notação polonesa</a> onde simplifica a sintaxe da linguagem de uma
maneira sem acrescentar ambiguidades: operações e operandos são
denotados de forma explícita em sua ordem de precedência no uso de
listas.
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #51afef;">(</span>opera&#231;&#227;o operando-1 operando-2<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>+ 1 2<span style="color: #51afef;">)</span> <span style="color: #62686E;">;; </span><span style="color: #62686E;">=&gt; 3</span>
</pre>
</div>

<p>
Esta família de linguagens foi desenhada para abstrair a complexidade
do hardware de um computador, criando uma interface para que um humano
possa se comunicar de maneira expressiva com a máquina. O primeiro
Lisp denotado historicamente por <a href="https://pt.wikipedia.org/wiki/Lisp">LISP</a> foi criado por <a href="https://pt.wikipedia.org/wiki/John_McCarthy">John McCarthy</a> em
1958 nos laboratórios do MIT, USA.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> O que é Common Lisp?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Common Lisp é um dialeto multi-paradigma da linguagem de programação
Lisp. Suporta programação procedural, orientação a
objetos e o paradigma funcional, algo comum a todos os
Lisps, por sua próxima relação com a natureza do Cálculo Lambda.
</p>

<p>
Foi criada por Guy L. Steele nos anos 80, com o intuito de combinar
aspectos de diversos dialetos anteriores, incluindo Scheme. Em 1994
foi publicada no padrão <a href="http://cvberry.com/tech_writings/notes/common_lisp_standard_draft.html">ANSI Information Technology - Programming
Language - Common Lisp, registro X3.226-1994 (R1999)</a>. Common Lisp é
bem maior e semanticamente mais complexa que um dialeto como Scheme,
uma vez que foi projetada para ser uma linguagem comercial e ser
compatível com os diversos outros dialetos Lisp dos quais derivou.
</p>

<div class="org-src-container">

<<<<<<< HEAD
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">hello-world</span> <span style="color: #c678dd;">()</span> <span style="color: #525252;">;; </span><span style="color: #525252;">defini&#231;&#227;o de fun&#231;&#227;o</span>
  <span style="color: #c678dd;">(</span>princ <span style="color: #99bb66;">"Hello, Lispers!"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>hello-world<span style="color: #51afef;">)</span> <span style="color: #525252;">;; </span><span style="color: #525252;">chamada de fun&#231;&#227;o</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">resultado: Hello, Lispers!</span>
=======
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">hello-world</span> <span style="color: #C57BDB;">()</span> <span style="color: #62686E;">;; </span><span style="color: #62686E;">defini&#231;&#227;o de fun&#231;&#227;o</span>
  <span style="color: #C57BDB;">(</span>princ <span style="color: #7bc275;">"Hello, Lispers!"</span><span style="color: #C57BDB;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>hello-world<span style="color: #51afef;">)</span> <span style="color: #62686E;">;; </span><span style="color: #62686E;">chamada de fun&#231;&#227;o</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">resultado: Hello, Lispers!</span>
>>>>>>> Compile index.html
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Links de Aprendizado sobre Common Lisp</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Apresentação</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="http://lisp-lang.org/">Site oficial de Common Lisp</a>, apresentação sobre a linguagem e seu poder.
</li>
<li><a href="https://github.com/CodyReichert/awesome-cl">Awesome-CL</a>, uma lista imensa sobre frameworks e ferramentas para
Common Lisp.
</li>
<li><a href="http://www.lisperati.com/casting.html">Lisperati Casting</a>, uma história em quadrinhos sobre a magia que é
programar em Lisp.
</li>
<li><a href="http://www.avelino.xxx/hist%C3%B3ria-do-lisp-abra-os-olhos-para-programa%C3%A7%C3%A3o-funcional/">História do Lisp</a>, entenda como o Lisp começou e porque temos tantos dialetos.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Documentação e tutoriais</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="http://bnmcgn.github.io/lisp-guide/lisp-exploration.html">Common Lisp REPL Exploration Guide</a>, um guia interessantíssimo sobre
a exploração de Common Lisp pelo REPL <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</li>
<li><a href="https://lispcookbook.github.io/cl-cookbook/">Cookbook de Common Lisp</a>. Também inclui tutoriais sobre Quicklisp (veja a seção de Tooling).
</li>
<li><a href="http://www.lispworks.com/documentation/HyperSpec/Front/">Common Lisp Hyperspec</a>
  Sua primeira parada ao pesquisar por documentação de Common Lisp. <a href="http://clhs.lisp.se/">(Mirror)</a>
</li>
<li><a href="https://www.cliki.net/">CLiki, a Wiki de Common Lisp</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Livros</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Common Lisp: A Gentle Introduction to Symbolic Computation, por David S. Touretsky
<ul class="org-ul">
<li>[Amazon] <a href="https://www.amazon.com.br/Common-LISP-Introduction-Computation-Engineering-ebook/dp/B00IZUEG1G/">Livro físico</a>
</li>
<li><a href="https://www.cs.cmu.edu/~dst/LispBook/">Versão online</a>
</li>
</ul>
</li>
<li>[Amazon] <a href="https://www.amazon.com.br/Land-Lisp-Learn-Program-Game-ebook/dp/B004AE3P4K/">Land of Lisp: Learn to Program in Lisp, One Game at a Time!</a>, por Conrad Barski
</li>
<li>[Amazon] <a href="https://www.amazon.com.br/Common-Lisp-Recipes-Problem-Solution-Approach-ebook/dp/B01JFTONBS/">Common Lisp Recipes: A Problem-Solution Approach</a>, por Edmund Weitz
</li>
<li>Practical Common Lisp, por Peter Seibel
<ul class="org-ul">
<li>[Amazon] <a href="https://www.amazon.com.br/Practical-Common-Lisp-Peter-Seibel/dp/1590592395">Livro físico</a>
</li>
<li><a href="http://www.gigamonkeys.com/book/">Versão online</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tooling</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Emacs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Emacs é o melhor editor de texto em consenso para se programar em
Common Lisp.
</p>

<ul class="org-ul">
<li>[Inglês] <a href="https://www.gnu.org/software/emacs/">Site oficial</a>
</li>
<li>[Inglês] <a href="https://github.com/bbatsov/prelude">Prelude</a> uma configuração com baterias pro Emacs para bons hábitos
</li>
<li>[Inglês] Mini-manual do Emacs, por <a href="https://github.com/tuhdo">tuhdo</a>
<ul class="org-ul">
<li><a href="http://tuhdo.github.io/emacs-tutor.html">Parte 1: O Básico</a>
</li>
<li><a href="http://tuhdo.github.io/emacs-tutor2.html">Parte 2: Por que parênteses importam</a>
</li>
<li><a href="http://tuhdo.github.io/emacs-tutor3.html">Parte 3: Customizando e extendendo o Emacs</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Portacle</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Portacle é um reempacotamento de Emacs. Diferente do programa original,
Portacle é uma edição voltada para programadores Common Lisp. Este editor
já inclui o SBCL (implementação de Common Lisp), Quicklisp (para gerenciar
projetos e pacotes), e Magit (para lidar com versionamento de código em
Git). Enquanto recomendamos instalar o Emacs e aprender a configurá-lo,
esta é também uma excelente ferramenta para iniciantes que queiram um
ambiente Common Lisp que funcione logo de cara, ou mesmo para lispeiros
experientes que queiram um ambiente CL que possam carregar no pendrive,
e que funcione em quase qualquer sistema operacional.
</p>

<ul class="org-ul">
<li>[Inglês] <a href="https://portacle.github.io/">Link oficial do Portacle</a>
</li>
<li>[Inglês] <a href="https://github.com/portacle/portacle">Repositório oficial</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> SLIME</h3>
<div class="outline-text-3" id="text-3-3">
<p>
SLIME significa <i>SUPERIOR LISP INTERACTION MODE for EMACS</i>. É uma
das coisas mais fascinante que se faz Common Lisp uma linguagem tão
produtiva e o Emacs ser seu editor ideal.
</p>

<ul class="org-ul">
<li>[Inglês] <a href="https://astraybi.wordpress.com/2015/08/02/how-to-install-slimesbclquicklisp-into-emacs/">Instalando SLIME + SBCL + Quicklisp no Emacs</a>, por Astray<sub>BI</sub>
</li>
<li>[Inglês] <a href="https://github.com/quicklisp/quicklisp-slime-helper">Repositório do <code>quicklisp-slime-helper</code></a>

<p>
Este pacote torna mais fácil a instalação do SLIME, a partir do
Quicklisp.
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Compiladores</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>[Inglês] <a href="http://sbcl.org/">SBCL</a>: Steel Bank Common Lisp (recomendado)
</li>
<li>[Inglês] <a href="https://common-lisp.net/project/ecl/">ECL</a>: Embedabble Common Lisp
</li>
<li>[Inglês] <a href="https://clisp.sourceforge.io/">GNU CLISP</a> (obsoleto desde 2010, artefato histórico)
</li>
<li>[Inglês] <a href="https://ccl.clozure.com/">CCL</a>: Clozure Common Lisp (<a href="https://clojure.org/">Clojure</a> é outra coisa, não confunda!)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Quicklisp</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Quicklisp é o gerenciador de pacote (sistemas nos jargões de CL),
muito útil para integrar sua aplicação usando pacotes de terceiro.
</p>

<ul class="org-ul">
<li>[Inglês] <a href="https://www.quicklisp.org/beta/">Site oficial do Quicklisp</a>
</li>
<li>[Inglês] <a href="https://www.xach.com/lisp/quickproject/">Quickproject: crie o esqueleto de um projeto de Common Lisp</a>

<p>
Este tutorial é extremamente útil para a criação de projetos
compatíveis com Quicklisp.
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Roswell</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Roswell é descrito como ser o instalador de lisp e launcher para
o ambiente em geral de Common Lisp que simplesmente funciona.
Tenta automatizar a instalação dos compiladores, pacotes do emacs
e criação de binários com Common Lisp. Vale a pena tentar dar uma
olhada!
</p>

<ul class="org-ul">
<li><a href="https://github.com/roswell/roswell">Roswell</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Projetos</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://next-browser.github.io/"><code>nEXT</code>, um browser escrito em Common Lisp orientado a teclado Emacs-like
usando WebKit</a>
</li>
<li><a href="https://github.com/adolenc/cl-neovim"><code>cl-neovim</code>, cliente de Common Lisp para Neovim</a>
</li>
<li><a href="https://github.com/ryukinix/lisp-inference"><code>lisp-inference</code>, um motor de inferência baseado em Cálculo Proposicional, escrito em Common Lisp</a>
</li>
<li><a href="https://github.com/ryukinix/lisp-chat"><code>lisp-chat</code>, um chat minimalista e experimental, escrito em Common Lisp</a>
</li>
<li><a href="https://github.com/lispgames/lispgames.github.io/wiki/Common-Lisp"><code>lispgames</code>, comunidade internacional de referência sobre desenvolvimento de jogos com Lisp, assim como Common Lisp</a>
</li>
<li><a href="https://github.com/froggey/Mezzano">Mezzano, um sistema operacional feito em Common Lisp</a> (<a href="https://github.com/froggey/MBuild">Link para o build system</a>)
</li>
<li><a href="https://github.com/luksamuk/opengames">Repositório de pequenos jogos com código aberto</a>.Neste repositório, foram feitos, em Common Lisp, os mini-jogos <code>cl-2048</code>, <code>cl-snake</code> e <code>dagarden</code>.
</li>
<li><a href="http://xzpeter.org/starwar/"><code>starwar</code>, um jogo feito em Common Lisp usando SDL</a> (<a href="https://github.com/xzpeter/starwar">Repositório</a>)
(<a href="https://github.com/commonlispbr/starwar">Fork da nossa comunidade</a>)
</li>
<li><a href="https://github.com/azzamsa/awesome-cl-software">Awesome-CL-software</a>, uma lista sobre aplicações feitas em Common Lisp!
</li>
<li><a href="https://github.com/aimacode/aima-lisp">Implementação em Common Lisp dos algoritmos do livro <i>Artificial Intelligence - A Modern Approach</i>, de Russell e Norvig</a>
</li>
<li><a href="https://github.com/norvig/paip-lisp">Implementação em Common Lisp dos algoritmos do livro <i>Paradigms of Artificial Intelligente Programming</i>, de Norvig</a>
</li>
<li><a href="https://github.com/kingcons/coleslaw"><code>coleslaw</code>, software em Common Lisp para escrever seu próprio blog estático</a>, similar a Frog, Jekyll e Hakyll.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Apêndice: Referências amplas</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>[Inglês] Build Your Own Lisp, por Daniel Holder
<ul class="org-ul">
<li>[Amazon] <a href="https://www.amazon.com.br/Build-Your-Own-Lisp-English-ebook/dp/B00ONV8CNO/">Livro físico</a>
</li>
<li><a href="http://www.buildyourownlisp.com/">Versão online</a>
</li>
</ul>
</li>
<li><a href="https://github.com/luksamuk/YASWEG">YASWEG (Yet Another Static Website Generator), sintaxe para geração de websites estáticos</a>, escrito em Guile Scheme.
</li>
<li>[Youtube/Inglês] <a href="https://www.youtube.com/watch?v=cMxbSsRntv4">Transcrição regravada da mini-palestra de Alan Turing</a>
  Originalmente difundida na rádio BBC de Londres, em 15 de maio de 1951. Leitura por James Grime.
</li>
<li><a href="http://lerax.me/lisp-bookmarks/">Lista de links relacionados a Lisp e/ou à cultura cyberpunk em geral</a>
  É provável que alguns destes links acabem integrados a esta lista.
</li>
<li>[Inglês] <a href="http://hyperpolyglot.org/lisp">Comparativo entre os dialetos Common Lisp, Racket, Clojure e Emacs Lisp</a>
</li>
<li>[Inglês] <a href="http://borretti.me/article/common-lisp-sotu-2015">Estado do Ecossistema de Common Lisp (2015)</a>
</li>
<li>[Youtube/Inglês] <a href="https://www.youtube.com/playlist?list=PLBgJcoaU2hl-JnoVOzjYB5qk_PfYjPm-I">Playlist: Série Process Hacking</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Lisp é uma abreviação de <b><b>LISt Processing</b></b>, processamento de listas.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
REPL significa Read-Eval-Print-Loop, muito comum em linguagens
interativas como Lisp e Python. A propósito, o conceito foi
inicialmente feito justamente em Lisp!
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-02-10 Sat&gt;</span></span></p>
<p class="author">Author: Manoel Vilela, Lucas Vieira</p>
<p class="date">Created: 2018-02-12 Mon 09:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
